# DuctSizeSettings Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSizeSettings Class
Members See Also
---
Duct sizes settings
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class DuctSizeSettings : Element,
	IEnumerable<KeyValuePair<DuctShape, DuctSizes>>
```

Visual Basic
---
```text
Public Class DuctSizeSettings _
	Inherits Element _
	Implements IEnumerable(Of KeyValuePair(Of DuctShape, DuctSizes))
```

Visual C++
---
```text
public ref class DuctSizeSettings : public Element,
	IEnumerable<KeyValuePair<DuctShape, DuctSizes^>>
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Mechanical..::..DuctSizeSettings
# See Also
DuctSizeSettings Members
Autodesk.Revit.DB.Mechanical Namespace